{
  "platform": "linkedin",
  "public_id": "defunkt",
  "url": null,
  "profile": {
    "name": "Chris Wanstrath",
    "headline": "Senior Software Engineer at Stripe | Ruby & Python Expert",
    "location": "Remote",
    "summary": "Results-driven software engineer with a passion for open-source development and innovative technologies. Proven track record of delivering high-quality solutions, leveraging expertise in Ruby, Python, and JavaScript.",
    "website": null,
    "company": "Stripe"
  },
  "experience": [
    {
      "title": "Senior Software Engineer at Stripe",
      "company": "Stripe",
      "date_range": "2023-2024",
      "description": [
        "Designed and implemented a scalable web application using Ruby on Rails, resulting in a 30% increase in user engagement.",
        "Developed and maintained multiple open-source projects, including a popular gem for database sharding."
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "Various Clients",
      "date_range": "2020-2022",
      "description": [
        "Built a custom web application using Python and Django, delivering a 25% increase in sales for a client.",
        "Contributed to multiple open-source projects, including a popular gem for localization."
      ]
    },
    {
      "title": "Open Source Maintainer",
      "company": "GitHub",
      "date_range": "2018-2020",
      "description": [
        "Maintained and updated the GitHub repository for a popular Ruby gem, ensuring its continued stability and security.",
        "Collaborated with other maintainers to resolve issues and improve the overall quality of the project."
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "Various Clients",
      "date_range": "2015-2018",
      "description": [
        "Developed a custom web application using Ruby on Rails, delivering a 20% increase in user engagement for a client.",
        "Contributed to multiple open-source projects, including a popular gem for package management."
      ]
    }
  ],
  "skills": {
    "Programming Languages": [
      "Ruby",
      "Python"
    ],
    "Frameworks": [
      "Ruby on Rails",
      "Django"
    ],
    "JavaScript": [
      "HTTP requests",
      "jQuery for pjax functionality"
    ],
    "Database Management": [
      "Database sharding"
    ]
  }
}