{
  "platform": "linkedin",
  "public_id": "fasterthanlime",
  "url": null,
  "profile": {
    "name": "Amos Wenger",
    "headline": "@bearcove Senior Software Engineer | Rust Systems Programming Expert",
    "location": "Lyon, France",
    "summary": "Highly motivated and experienced software engineer with a strong passion for Rust systems programming. Proven track record of delivering high-quality projects, including GPU-accelerated cross-platform terminal emulators and lightweight animation libraries.",
    "website": null,
    "company": "@bearcove"
  },
  "experience": [
    {
      "title": "@bearcove Senior Software Engineer",
      "company": "@bearcove",
      "date_range": "2024 - Present",
      "description": [
        "Led the development of wezterm, a GPU-accelerated cross-platform terminal emulator.",
        "Designed and implemented various tools for Rust development, including cargo-bloat-lib and substance."
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "Various Clients",
      "date_range": "2023 - 2024",
      "description": [
        "Developed a lightweight animation library for Dioxus.",
        "Contributed to various open-source projects, including facet-rs/facet and bearcove/dodeca."
      ]
    },
    {
      "title": "Open Source Maintainer",
      "company": "Various Projects",
      "date_range": "2022 - 2023",
      "description": [
        "Maintained and improved various open-source projects, including Python libraries.",
        "Participated in code reviews and ensured high-quality code standards."
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "Various Clients",
      "date_range": "2020 - 2022",
      "description": [
        "Developed various Python projects, including a machine learning library.",
        "Contributed to open-source projects and participated in online communities."
      ]
    }
  ],
  "skills": {
    "Rust Systems Programming": [
      "Expertise in building high-performance systems using Rust.",
      "Experience with GPU-accelerated programming using Rust.",
      "Knowledge of Rust's ownership system and borrow checker."
    ],
    "Template Engines": [
      "Understanding of Jinja-like syntax and template engines.",
      "Experience with facet-rs/facet and bearcove/dodeca.",
      "Ability to design and implement efficient template rendering systems."
    ]
  }
}