{
  "platform": "linkedin",
  "public_id": "karpathy",
  "url": null,
  "profile": {
    "name": "Andrej",
    "headline": "Senior Software Engineer | Building Large Language Models and Automating Research Discoveries at Netflix",
    "location": "Stanford",
    "summary": "Highly motivated software engineer with expertise in natural language processing, machine learning, and database systems. Proven track record of building scalable solutions and automating complex tasks.",
    "website": null,
    "company": "Based on the provided information, I would recommend Netflix as the most realistic employer for Andrej.\n\nNetflix"
  },
  "experience": [
    {
      "title": "Senior Software Engineer",
      "company": "Netflix",
      "date_range": "2022 - Present",
      "description": [
        "Designed and implemented large language models using transformer architectures, achieving state-of-the-art results in various NLP benchmarks.",
        "Developed and deployed a web interface for arxiv submissions, improving user experience and reducing manual effort.",
        "Created tools like rustbpe and nanochat, demonstrating expertise in natural language processing and machine learning."
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "Various Clients",
      "date_range": "2020 - 2022",
      "description": [
        "Developed open-source projects on GitHub, including a popular transformer-based model for NLP tasks.",
        "Collaborated with researchers to automate research publications discovery and analysis, improving productivity and accuracy."
      ]
    },
    {
      "title": "Open Source Maintainer",
      "company": "arxiv.org",
      "date_range": "2019 - 2020",
      "description": [
        "Maintained the arxiv.org web interface, ensuring high availability and performance.",
        "Contributed to the development of new features and bug fixes, demonstrating expertise in database systems."
      ]
    }
  ],
  "skills": {
    "categories": [
      "Programming Languages",
      "Machine Learning",
      "Database Systems"
    ],
    "points": [
      "JavaScript (ES6+)",
      "Python (TensorFlow, PyTorch)",
      "Rust (for building nanochat)",
      "SQL (for database sharding and optimization)",
      "Natural Language Processing (NLP) with transformer architectures",
      "Machine Learning with scikit-learn and TensorFlow"
    ]
  }
}