{
  "platform": "linkedin",
  "public_id": "kelseyhightower",
  "url": null,
  "profile": {
    "name": "Kelsey Hightower",
    "headline": "Senior Software Engineer | Cloud-Native Solutions Expert",
    "location": "Washington",
    "summary": "Results-driven software engineer with a passion for cloud-native technologies, Rust systems programming, and open-source contributions. Proven track record of delivering scalable solutions with a focus on security, reliability, and performance.",
    "website": null,
    "company": "Based on Kelsey Hightower's tech stack and location, I would recommend:\n\nInsulet Corporation"
  },
  "experience": [
    {
      "title": "Senior Software Engineer",
      "company": "Insulet Corporation",
      "date_range": "2023 - Present",
      "description": [
        "Designed and implemented cloud-native applications using Cloud Run, Kubernetes, and HashiCorp's Vault for secure data management.",
        "Collaborated with cross-functional teams to develop scalable solutions for Insulet's products, ensuring high availability and performance.",
        "Contributed to open-source projects, including the development of a toy Kubernetes scheduler and Kubernetes Redis cluster configurations."
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "Various Clients",
      "date_range": "2020 - 2022",
      "description": [
        "Developed multiple cloud-based applications using Python, Cloud Run, and HashiCorp's Vault for secure data management.",
        "Provided technical support and guidance to clients on cloud-native technologies and Rust systems programming."
      ]
    },
    {
      "title": "Open Source Maintainer",
      "company": "Various Open-Source Projects",
      "date_range": "2018 - 2020",
      "description": [
        "Maintained multiple open-source projects, including a popular Python library for data analysis.",
        "Contributed to the development of new features and bug fixes, ensuring the project's stability and security."
      ]
    }
  ],
  "skills": {
    "Programming Languages": [
      "Rust",
      "Python"
    ],
    "Cloud Platforms": [
      "Google Cloud Platform (GCP)",
      "Amazon Web Services (AWS)"
    ],
    "Containerization": [
      "Kubernetes",
      "Docker"
    ],
    "Security": [
      "HashiCorp's Vault",
      "Cloud Run Security Best Practices"
    ],
    "DevOps": [
      "Serverless Computing",
      "CI/CD Pipelines"
    ]
  }
}