{
  "platform": "linkedin",
  "public_id": "rafaelfranca",
  "url": null,
  "profile": {
    "name": "Rafael Mendonça França",
    "headline": "Senior Software Engineer | Ruby on Rails Expert | Ottawa, ON",
    "location": "Ottawa, ON",
    "summary": "Highly motivated and detail-oriented software engineer with a passion for quality assurance and continuous learning. Proficient in Ruby on Rails, Dev Containers, Docker, and Crystal. Proven track record of delivering high-quality solutions while collaborating with cross-functional teams.",
    "website": null,
    "company": "Shopify"
  },
  "experience": [
    {
      "title": "Senior Software Engineer",
      "company": "Shopify",
      "date_range": "2022 - Present",
      "description": [
        "Developed and maintained multiple Ruby on Rails applications, ensuring scalability, performance, and reliability.",
        "Collaborated with the DevOps team to implement containerization using Docker, resulting in improved deployment efficiency and reduced downtime.",
        "Led code reviews and ensured adherence to best practices, promoting a culture of quality and continuous improvement."
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "Various Clients",
      "date_range": "2021 - 2022",
      "description": [
        "Developed custom web applications using Ruby on Rails for clients across North America.",
        "Conducted code reviews and provided technical guidance to junior developers, enhancing their skills and knowledge."
      ]
    },
    {
      "title": "Open Source Maintainer",
      "company": "Various Projects",
      "date_range": "2020 - 2021",
      "description": [
        "Contributed to multiple open-source projects, including Ruby on Rails and testing frameworks.",
        "Participated in community discussions, provided feedback, and helped resolve issues for other contributors."
      ]
    }
  ],
  "skills": [
    {
      "category": "Programming Languages",
      "points": [
        "Ruby",
        "Crystal"
      ]
    },
    {
      "category": "Frameworks & Libraries",
      "points": [
        "Ruby on Rails",
        "Dev Containers",
        "Docker"
      ]
    },
    {
      "category": "Testing Frameworks",
      "points": [
        "Minitest",
        "RSpec"
      ]
    }
  ]
}