{
  "platform": "linkedin",
  "public_id": "raysan5",
  "url": null,
  "profile": {
    "name": "Ray",
    "headline": "Senior Software Engineer | raylibtech",
    "location": "Barcelona",
    "summary": "Highly skilled videogames developer with expertise in game project templates, Lua libraries, C libraries for physics and graphics, and custom game engines. Proven track record of contributing to the development of popular videogames libraries like raylib.",
    "website": null,
    "company": "@raylibtech"
  },
  "experience": [
    {
      "title": "Senior Software Engineer",
      "company": "@raylibtech",
      "date_range": "2022 - Present",
      "description": [
        "Developed and maintained game project templates for raylib, ensuring seamless integration with various game engines.",
        "Contributed to the development of raylib, a popular videogames library used by thousands of developers worldwide.",
        "Reviewed pull requests from other developers to ensure high-quality code and maintain the integrity of the library."
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "Various Clients",
      "date_range": "2020 - 2022",
      "description": [
        "Developed custom game engines for clients, utilizing expertise in Lua libraries and C libraries for physics and graphics.",
        "Created game project templates for various clients, ensuring efficient development and deployment of games."
      ]
    },
    {
      "title": "Open Source Maintainer",
      "company": "raylib Community",
      "date_range": "2018 - 2020",
      "description": [
        "Maintained the raylib repository, ensuring timely updates and bug fixes.",
        "Contributed to the development of new features and improved performance for the library."
      ]
    },
    {
      "title": "Game Project Developer",
      "company": "Various Game Studios",
      "date_range": "2015 - 2018",
      "description": [
        "Developed games using raylib, utilizing expertise in game project templates and Lua libraries.",
        "Collaborated with game developers to ensure seamless integration of raylib into their projects."
      ]
    }
  ],
  "skills": {
    "Programming Languages": [
      "C",
      "Lua"
    ],
    "Game Engines": [
      "raylib"
    ],
    "Development Frameworks": [
      "raygui"
    ],
    "Database Operations": [
      "File system operations abstraction (e.g., `rres` and `GetDirectoryFileCount()`/`GetDirectoryFileCountEx()`)",
      "Database sharding (relevant to file system operations)"
    ],
    "GUI Development": [
      "Immediate-mode GUI library (raygui)",
      "Reviewing pull requests related to GUI development (e.g., `rconpacker`)"
    ]
  }
}