{
  "platform": "linkedin",
  "public_id": "seanmonstar",
  "url": null,
  "profile": {
    "name": "Sean McArthur",
    "headline": "Senior Software Engineer | Palantir Technologies | Remote",
    "location": "Remote",
    "summary": "Highly motivated software engineer with a passion for Rust systems programming and database sharding. Proficient in Python and experienced in open source development.",
    "website": null,
    "company": "Based on the provided information, I would recommend Palantir Technologies as a potential employer for Sean Mc"
  },
  "experience": [
    {
      "title": "Senior Software Engineer, Palantir Technologies",
      "company": "Palantir Technologies",
      "date_range": "2023 - Present",
      "description": [
        "Designed and implemented a high-performance database sharding system using Rust and PostgreSQL.",
        "Collaborated with cross-functional teams to develop and deploy large-scale data integration projects."
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "Various Clients",
      "date_range": "2020 - 2023",
      "description": [
        "Developed multiple open-source projects using Python, including a popular data visualization library.",
        "Provided expert consulting services to clients on database design and optimization."
      ]
    },
    {
      "title": "Open Source Maintainer",
      "company": "Rust-lang",
      "date_range": "2022 - 2023",
      "description": [
        "Contributed to the development of the Rust compiler, focusing on performance optimization and code generation.",
        "Mentored junior developers on best practices for Rust programming."
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "Various Clients",
      "date_range": "2020 - 2022",
      "description": [
        "Developed multiple web applications using Python and Flask, including a popular e-commerce platform.",
        "Provided expert consulting services to clients on software development best practices."
      ]
    }
  ],
  "skills": {
    "Programming Languages": [
      "Rust",
      "Python"
    ],
    "Database Systems": [
      "PostgreSQL",
      "Cranelift"
    ],
    "Development Frameworks": [
      "Flask"
    ],
    "Open Source Development": [
      "Rust-lang",
      "GitHub"
    ]
  }
}