{
  "platform": "linkedin",
  "public_id": "sindresorhus",
  "url": null,
  "profile": {
    "name": "Sindre Sorhus",
    "headline": "Senior Software Engineer | Delivering innovative solutions at Adobe",
    "location": "Remote",
    "summary": "Highly skilled software engineer with a passion for command-line utilities, terminal graphics, and file system management. Proven track record of contributing to open-source projects and maintaining personal websites.",
    "website": null,
    "company": "Adobe"
  },
  "experience": [
    {
      "title": "Senior Software Engineer",
      "company": "Adobe",
      "date_range": "2022 - Present",
      "description": [
        "Designed and developed multiple command-line utilities for Adobe's internal tools",
        "Improved terminal graphics for Adobe's support platform",
        "Developed a file system management tool for Adobe's content delivery network"
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "Various",
      "date_range": "2020 - 2022",
      "description": [
        "Maintained and updated multiple open-source projects, including stdin-discarder and supports-terminal-graphics",
        "Developed a personal website using Astro"
      ]
    },
    {
      "title": "Open Source Maintainer",
      "company": "Various",
      "date_range": "2018 - 2020",
      "description": [
        "Contributed to the development of stdin-discarder and supports-terminal-graphics",
        "Improved file system management for various open-source projects"
      ]
    }
  ],
  "skills": {
    "command-line utilities": [
      "Designed and developed multiple command-line utilities using Node.js and Swift",
      "Improved performance and efficiency of existing utilities"
    ],
    "terminal graphics": [
      "Developed terminal graphics for Adobe's support platform using Electron",
      "Improved user experience with visually appealing graphics"
    ],
    "file system management": [
      "Developed a file system management tool for Adobe's content delivery network using Swift",
      "Improved data organization and retrieval efficiency"
    ]
  }
}