{
  "platform": "linkedin",
  "public_id": "willmcgugan",
  "url": null,
  "profile": {
    "name": "Will McGugan",
    "headline": "Senior Software Engineer | Delivering innovative solutions at Salesforce",
    "location": "Edinburgh, UK",
    "summary": "Highly motivated and detail-oriented software engineer with a passion for open-source development. Proficient in Rust systems programming and Python, with a strong focus on database sharding and terminal emulators.",
    "website": null,
    "company": "Salesforce"
  },
  "experience": [
    {
      "title": "Senior Software Engineer",
      "company": "Salesforce",
      "date_range": "2023 - Present",
      "description": [
        "Designed and implemented scalable database sharding solutions for high-traffic applications.",
        "Developed and maintained terminal emulators using Rust, ensuring seamless user experience."
      ]
    },
    {
      "title": "Freelance Developer",
      "company": "",
      "date_range": "2022 - 2023",
      "description": [
        "Contributed to open-source projects such as Textualize/textual and batrachianai/toad.",
        "Collaborated with cross-functional teams to deliver high-quality software solutions."
      ]
    },
    {
      "title": "Open Source Maintainer",
      "company": "",
      "date_range": "2021 - 2022",
      "description": [
        "Maintained and updated the Textualize/textual project, ensuring its continued relevance and adoption.",
        "Engaged with the open-source community to gather feedback and improve the project's overall quality."
      ]
    },
    {
      "title": "Python Developer",
      "company": "",
      "date_range": "2020 - 2021",
      "description": [
        "Developed and deployed Python-based applications, leveraging libraries such as pydantic for data validation.",
        "Participated in code reviews and contributed to the growth of the open-source community."
      ]
    }
  ],
  "skills": {
    "Programming Languages": [
      "Rust",
      "Python"
    ],
    "Database Sharding": [
      "Understanding of data structures and validation using pydantic.",
      "Experience with designing and implementing scalable database sharding solutions."
    ],
    "Terminal Emulators": [
      "Insight into user interface and terminal interactions through discussions on Textualize/textual.",
      "Development and maintenance of terminal emulators using Rust."
    ]
  }
}